CpuBenchmark/src/InformationRegisters/РезультатыТестирования/РезультатыТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыТестирования</name>
  <resources>
    <name>КоличествоИтераций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПотоков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИмяТеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Процессор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдТеста</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тест</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

CpuBenchmark/src/InformationRegisters/РезультатыТестирования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записать.
// 
// Параметры:
//  ДанныеЗамера - см. ЗамерВремени.ИнициализироватьДанныеЗамера 
//  ИмяТеста - Строка - Имя теста
Процедура Записать(ДанныеЗамера, Знач ИмяТеста) Экспорт
	
	Инфо  	= Новый СистемнаяИнформация();
	ИдТеста = Новый УникальныйИдентификатор();
	
	Набор = СоздатьНаборЗаписей();
	
	Для Каждого Замер Из ДанныеЗамера Цикл
		
		Запись 		   = Набор.Добавить();
		Запись.ИдТеста = ИдТеста;
		Запись.Тест	   = Замер.Наименование;
		Запись.Дата	   = Замер.Дата;
		Запись.КоличествоИтераций = Замер.КоличествоИтераций;
		Запись.Длительность = Замер.Длительность;
		Запись.КоличествоПотоков = Замер.КоличествоПотоков;
		Запись.ИмяТеста = ИмяТеста;
		Запись.ИмяКомпьютера = ИмяКомпьютера();			
		Запись.Процессор = Инфо.Процессор;			
	КонецЦикла;
	
	Набор.Записать(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
